<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8" />
    <title>Практика по заданию 16. Программа обработки последовательности чисел </title>
    <link rel="stylesheet" href="styles.css">
</head>
<body>
    <main class="main">
        <section class="wrapper">
            <header class="header">
                <nav class="menu">
                    <a class="menu__item" href="mainpage.html">Главная</a>
                    <a class="menu__item" href="theorymain.html">Теория</a>
                    <a class="menu__item" href="practicemain.html">Практика</a>
                </nav>
            </header>
            <section class="about">
                <h2>Тип 16. Программа обработки последовательности чисел. Практика</h2>
                <div style="height: 20px;"></div>
                <!-- Задание 1 -->
                <div class="quiz-item">   
                    <p>Напишите программу, которая в последовательности натуральных десятичных чисел определяет <b>количество элементов</b>, запись которых <u>в системе счисления с основанием 7 оканчивается цифрой 1</u>. Если среди входных данных таких элементов нет, программа должна вывести «NO».</p>
                    <p>Программа получает на вход в первой строке натуральное число – количество чисел N (3 ≤ N ≤ 10 000), затем N натуральных чисел, не превышающих 30 000, каждое в отдельной строке.</p>
                    <p>Программа должна вывести одно число – количество десятичных чисел (элементов последовательности), запись которых в 7-ричной системе счисления оканчивается цифрой 1, или «NO», если среди входных данных таких элементов нет.</p>
                    <p><i>Пример работы программы</i></p>
                    <table class="t13">
                        <tr>
                            <th>Входные данные</th>
                            <th>Выходные данные</th>
                        </tr>
                        <tr>
                            <td>6<br>12<br>15<br>10<br>71<br>50<br>11<br></td>
                            <td>3</td>
                        </tr>
                    </table>
                    <div style="height: 10px;"></div>
                    <details>
                    <summary>Посмотреть пояснение</summary>
                        <div class="explanation-content">
                           Для проверки последней цифры в 7-ричной системе используем остаток от деления на 7:
                            <pre><code>
                                n = int(input())
                                count = 0
                                for _ in range(n):
                                    x = int(input())
                                    if x % 7 == 1:
                                        count += 1
                                if count &gt; 0:
                                    print(count)
                                else:
                                    print("NO")
                            </code></pre>
                        </div>
                    </details>
                </div>
                <div style="height: 50px;"></div>
                <script>
                    fetch('footer.html')
                        .then(response => response.text())
                        .then(data => {
                         document.getElementById('footer-placeholder').innerHTML = data;
                    }); 
                </script>
            </section>
        </section>
    </main>
    <div id="footer-placeholder"></div>
</body>
</html>




